Revit 2026 API

# ColorFillSchemeEntryCaption Property

---

The text displayed in [!:Autodesk::Revit::DB::ColorFillLegend] for this entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Caption { get; set; }
```
```vb
Public Property Caption As String
	Get
	Set
```
```cpp
public:
property String^ Caption {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Caption : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: newCaption is an empty string or contains only whitespace. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This property is only meaningful for by range scheme.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace